INSERT INTO groups (group_number, max_students, faculty_code, curator) VALUES
('ИСП-101', 25, 'ФИТ', 'Иванов И.И.'),
('ИСП-102', 22, 'ФИТ', 'Петров П.П.'),
('ВЕБ-201', 30, 'ДИЗАЙН', 'Сидоров С.С.'),
('СИС-301', 18, 'ФИТ', 'Кузнецов К.К.'),
('МРК-401', 25, 'ЭКОНОМ', 'Смирнова А.А.'),
('ИСП-103', 24, 'ФИТ', 'Васильев В.В.'),
('ВЕБ-202', 28, 'ДИЗАЙН', 'Федоров Ф.Ф.'),
('СИС-302', 20, 'ФИТ', 'Михайлов М.М.'),
('МРК-402', 26, 'ЭКОНОМ', 'Новиков Н.Н.'),
('ТЗИ-501', 15, 'ИБ', 'Алексеев А.А.');

INSERT INTO schedule (group_number, lab_number, discipline, weekday, lesson_number) VALUES
('ИСП-101', '302-а', 'Основы программирования', 'Понедельник', 1),
('ИСП-102', '405', 'Базы данных', 'Понедельник', 2),
('ВЕБ-201', '101-б', 'Веб-дизайн', 'Вторник', 3),
('СИС-301', '208', 'Сетевые технологии', 'Среда', 1),
('МРК-401', '501', 'Маркетинг', 'Четверг', 4),
('ИСП-103', '302-б', 'Алгоритмы', 'Понедельник', 3),
('ВЕБ-202', '101-а', 'Колористика', 'Вторник', 2),
('СИС-302', '209', 'Операционные системы', 'Среда', 2),
('МРК-402', '502', 'Менеджмент', 'Пятница', 1),
('ТЗИ-501', '315', 'Криптография', 'Пятница', 3);
